Services/src/InformationRegisters/С_РегистрацияСервисов/С_РегистрацияСервисов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>С_РегистрацияСервисов</name>
  <resources>
    <name>Включен</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ДатаДействияС</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаДействияПо</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>Логин</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Пароль</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>STATUS</name>
    <type>
      <types>EnumRef.СтатусыСервисовИТС</types>
    </type>
  </resources>
  <attributes>
    <name>IDCUSTOMER</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>IDREQUEST</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>NAMECUSTOMER</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Extra</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>ПользовательСервиса</name>
    <type>
      <types>CatalogRef.С_ПользователиСервисов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сервис</name>
    <type>
      <types>CatalogRef.С_Сервисы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Партнер</name>
    <type>
      <types>CatalogRef.С_Партнеры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>IDDOCREQUEST</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>IDSERVICE</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>IDSERVICEVA</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Services/src/Catalogs/С_Сервисы/С_Сервисы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>С_Сервисы</name>
  <predefined>
    <items>
      <name>All</name>
      <description>All</description>
    </items>
    <items>
      <name>CurrClassifier</name>
      <description>Curr classifier</description>
    </items>
    <items>
      <name>DirectBank</name>
      <description>Direct bank</description>
    </items>
    <items>
      <name>AddressClassifier</name>
      <description>Адресный классификатор</description>
    </items>
    <items>
      <name>Bankrupt</name>
      <description>Банкроты</description>
    </items>
    <items>
      <name>Blanks</name>
      <description>БСО</description>
    </items>
    <items>
      <name>Map</name>
      <description>Карты</description>
    </items>
    <items>
      <name>BanksClassifier</name>
      <description>Классификатор банков</description>
    </items>
    <items>
      <name>CurrRates</name>
      <description>Курсы валют</description>
    </items>
    <items>
      <name>ITS</name>
      <description>Не пройдена проверка ИТС</description>
    </items>
    <items>
      <name>OffContractors</name>
      <description>Реестр предприятий с повышенным риском совершения</description>
    </items>
    <items>
      <name>OrgInfo</name>
      <description>Свободный реестр (организация)</description>
    </items>
    <items>
      <name>KontrInfo</name>
      <description>Свободный реестр ЮЛ</description>
    </items>
    <items>
      <name>Einvoices</name>
      <description>ЭСЧФ</description>
    </items>
  </predefined>
  <attributes>
    <name>БесплатныйСервис</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

Services/src/HTTPServices/GetServices/Module.bsl
Функция GetServicesPOST(Запрос)
	
    Отказ = Ложь;
	КодОшибки = "";
	Ответ = Новый HTTPСервисОтвет(200);	
	
	СтруктураПараметров = С_СлужебныеПроцедурыФункцииСервер.РазобратьВходныеданные(Запрос);
	
	С_РаботаССервисамиСлужебный.ПроверитьОбщийДоступКСервисам(СтруктураПараметров,  Ответ, КодОшибки, Отказ);

	Если Отказ Тогда
		Возврат Ответ
	КонецЕсли;
	
	С_РаботаССервисамиСлужебный.ЗарегистрироватьИспользованиеСервиса(СтруктураПараметров, Справочники.С_Сервисы.BanksClassifier, КодОшибки, Отказ);
	
	Если Отказ Тогда
		С_СлужебныеПроцедурыФункцииСервер.УстановитьКодОшибки(Ответ, КодОшибки);
		Возврат Ответ
	КонецЕсли;
	ДанныеСервиса =  ПолучитьДанныеСервиса(СтруктураПараметров, КодОшибки, Отказ);																
	Ответ.Заголовки["Content-Type"] =  "text/xml;charset=UTF-8";
    Ответ.УстановитьТелоИзСтроки(ДанныеСервиса, КодировкаТекста.UTF8,ИспользованиеByteOrderMark.НеИспользовать);
	Возврат Ответ;	
	
КонецФункции

Функция ПолучитьДанныеСервиса(СтруктураПараметров, КодОшибки, Отказ)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РегистрацияСервисов.Включен,
	|	РегистрацияСервисов.ДатаДействияС,
	|	РегистрацияСервисов.ДатаДействияПо,
	|	РегистрацияСервисов.Сервис
	|ИЗ
	|	РегистрСведений.С_РегистрацияСервисов КАК РегистрацияСервисов
	|ГДЕ
	|	РегистрацияСервисов.ПользовательСервиса = &ПользовательСервиса
	|	И РегистрацияСервисов.Сервис В(&Сервис)
	|	И РегистрацияСервисов.Включен = Истина
	|	И РегистрацияСервисов.ДатаДействияПо >= &ДатаДействияПо";
		
	Запрос.УстановитьПараметр("ПользовательСервиса", СтруктураПараметров.ПользовательСервиса);
	
	МассивСервисов = Новый Массив;
	МассивСервисов.Добавить(Справочники.С_Сервисы.Bankrupt);
	МассивСервисов.Добавить(Справочники.С_Сервисы.BanksClassifier);
	МассивСервисов.Добавить(Справочники.С_Сервисы.OffContractors);
	МассивСервисов.Добавить(Справочники.С_Сервисы.AddressClassifier);
	Запрос.УстановитьПараметр("Сервис", МассивСервисов);
	Запрос.УстановитьПараметр("ДатаДействияПо", СтруктураПараметров.РабочаяДата);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка =  РезультатЗапроса.Выбрать();
	
	ЗаписьXML = С_ФормированиеXMLСервер.ПолучитьЗаписьXML();
	
	Пока Выборка.Следующий() Цикл
		ЗаписьXML.ЗаписатьНачалоЭлемента("Items");
		ЗаписьXML.ЗаписатьАтрибут("dateEnd",Формат(Выборка.ДатаДействияПо, "ДФ=yyyyMMdd"));	
		ЗаписьXML.ЗаписатьАтрибут("service",Строка(Выборка.Сервис.ИмяПредопределенныхДанных));
		ЗаписьXML.ЗаписатьКонецЭлемента();
	КонецЦикла;
	
	ЗаписьXML.ЗаписатьКонецЭлемента();
	Возврат ЗаписьXML.Закрыть();		
КонецФункции
